app/controllers/bookings_controller.rb

SELECT * FROM "bookings" WHERE ("bookings"."id" = 1212604381)
---
  def show
    @booking = Booking.find(params[:id])