app/controllers/bookings_controller.rb

SELECT * FROM "bookings" WHERE ("bookings"."practitioner_id" = 1819705844)
---
  def index
    @bookings = Booking.find_all_by_practitioner_id(@current_selected_pro)

SELECT * FROM "bookings" WHERE ("bookings"."id" = 1538779612)
---
  def edit
    @booking = Booking.find(params[:id])

SELECT * FROM "bookings" WHERE ("bookings"."id" = 1538779612)
DELETE FROM "bookings" WHERE "id" = 1538779612
---
  def destroy
    @booking = Booking.find(params[:id])
    @booking.destroy