app/controllers/clients_controller.rb

SELECT "clients".id FROM "clients" WHERE ("clients"."email" = E'foo1@example.com' AND "clients".id <> 2071878930) LIMIT 1
---
  def login_phone
    @client = Client.find_by_email(params[:login])

SELECT * FROM "clients" WHERE ("clients"."email" = E'cbonnet99@gmail.com') LIMIT 1
---
  def login
    @client = Client.find_by_email(params[:login])

INSERT INTO "clients" ("created_at", "updated_at", "phone_suffix", "phone_prefix", "password_salt", "question", "string", "password_hash", "reset_code", "email", "answer") VALUES('2009-12-08 09:45:52.329270', '2009-12-08 09:45:52.329270', E'12345678', E'021', NULL, NULL, NULL, NULL, NULL, E'cbonnnet@test.com', NULL) RETURNING "id"
---
  def create
    if params[:emails]
      if pro_logged_in?
        begin
          current_pro.add_clients(params[:emails], params[:send_email], params[:email_text], params[:email_signoff])
        rescue BlankEmailsException
          flash[:error] = t(:flash_error_client_email_not_empty)
        rescue InvalidEmailsException => e
          flash[:error] = t(:flash_error_client_some_emails_invalid) + "#{e.message}"
        else
          flash[:notice] = t(:flash_notice_client_clients_added)
        end
        if flash[:error].blank?
          redirect_to practitioner_clients_url(current_pro.permalink)
        else
          # render :action => "new"
          redirect_to new_practitioner_client_url(current_pro.permalink, :emails => params[:emails], :send_email => params[:send_email], :email_text => params[:email_text], :email_signoff => params[:email_signoff])
        end
      else
        flash[:error] = t(:flash_error_client_must_be_logged_in)
        redirect_to login_url
      end
    else
      @client = Client.new(params[:client])
      if @client.save