app/controllers/practitioners_controller.rb

  def update_selected
    @practitioner = Practitioner.find(params[:practitioner_id]) unless params[:practitioner_id].nil?
---
SELECT * FROM "practitioners" WHERE ("practitioners"."id" = 0)